storage/tests/7a42d5bb-883f-4389-b84e-621fbbe30efc/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/7a42d5bb-883f-4389-b84e-621fbbe30efc/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 35s max duration (incl. graceful stop):
              * default: 5 looping VUs for 5s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  1.0s/5s

running (02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  2.0s/5s

running (03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  3.0s/5s

running (04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  4.0s/5s

running (05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  5.0s/5s

running (06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (07.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (08.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (09.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (10.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (11.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (12.0s), 4/5 VUs, 1 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (13.0s), 3/5 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (14.0s), 2/5 VUs, 3 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s

running (15.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  5s


  █ TOTAL RESULTS 

    checks_total.......: 25     1.586538/s
    checks_succeeded...: 80.00% 20 out of 25
    checks_failed......: 20.00% 5 out of 25

    ✗ status ok
      ↳  80% — ✓ 20 / ✗ 5

    HTTP
    http_req_duration..............: avg=131.56ms min=5.61ms med=8.75ms max=590.78ms p(90)=335.98ms p(95)=364.78ms
      { expected_response:true }...: avg=67.54ms  min=5.61ms med=7.98ms max=287.06ms p(90)=241.63ms p(95)=248.87ms
    http_req_failed................: 20.00% 5 out of 25
    http_reqs......................: 25     1.586538/s

    EXECUTION
    iteration_duration.............: avg=13.56s   min=11.86s med=13.25s max=15.75s   p(90)=15.07s   p(95)=15.41s  
    iterations.....................: 5      0.317308/s
    vus............................: 1      min=1       max=5
    vus_max........................: 5      min=5       max=5

    NETWORK
    data_received..................: 18 kB  1.1 kB/s
    data_sent......................: 7.5 kB 475 B/s



running (15.8s), 0/5 VUs, 5 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  5s